emacs/.emacs.d/config.org
#+title: Emacs configuration file
#+property: header-args:emacs-lisp :tangle ~/dev/dotfiles/emacs/.emacs.d/init.el

* Startup Performance
Add a function to =emacs-startup-hook= to print out the duration of Emacs startup:

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
    (defun startup/display-startup-time ()
      (message "Emacs loaded in %s with %d garbage collections."
               (format "%.2f seconds"
                       (float-time
                         (time-subtract after-init-time before-init-time)))
               gcs-done))


    (add-hook 'emacs-startup-hook #'startup/display-startup-time)

    ;; automatically generate the natively compiled files when Emacs loads a new .elc file.
    ;; might freeze emacs for some time
    (setq comp-deferred-compilation t)

    ;; The default is 800 kilobytes.  Measured in bytes.
    (setq gc-cons-threshold most-positive-fixnum)

    ;; Debug errors with more info
    (setq debug-on-error t)
    ;; supress native comp warnings
    (setq native-comp-async-report-warnings-errors 'silent)
    ;; Suppress “ad-handle-definition: .. redefined” warnings during Emacs startup.
    (custom-set-variables '(ad-redefinition-action (quote accept)))
#+end_src

* Package init
- The use-package-always-ensure variable indicates that use-package should always try to install missing packages. For some libraries this is not appropriate, and in those cases you see the :ensure nil declaration as part of the use-package statement. This applies mainly to libraries which are installed as part of some other package (happens mostly with some libraries that come with org-mode).

- The use-package-always-defer sets :defer true as the default for all package declarations. This makes Emacs startup much faster by preventing packages from being loaded when Emacs starts, and only doing so when they are needed. Some packages don’t work well with this, so you’ll see some declarations when I explicitly set :defer nil to force the package to be loaded at startup, or :defer n to load the package, but only n seconds after startup.

- The use-package-verbose variable enables verbose loading of packages, useful for debugging. I set/unset this according to need.

- load-prefer-newer variable tells Emacs to prefer the .el file if it’s newer, even if there is a corresponding .elc file. Also, use auto-compile to autocompile files as needed.

#+begin_src emacs-lisp
  ;; Initialize package sources
  (require 'package)
  (custom-set-variables '(package-archives
                        '(("melpa"     . "https://melpa.org/packages/")
                          ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                          ("elpa"      . "https://elpa.gnu.org/packages/"))))

  (package-initialize)

  (when (not package-archive-contents)
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (when (not (package-installed-p 'use-package))
  (package-install 'use-package))

  ;; load use-package
  (require 'use-package)

  (custom-set-variables '(use-package-always-ensure t))
  ;; unfortunately, causes problem with general custom rune/leader-keys func not defined
  ;; (custom-set-variables '(use-package-always-defer t))
  ;; To see which package load when to optimize the startup time
  (custom-set-variables '(use-package-verbose t))

  (custom-set-variables '(load-prefer-newer t))
  (use-package auto-compile
  :defer nil
  :config (auto-compile-on-load-mode))
#+end_src
* Quelpa
Testing quelpa and to install packages directly from their github repositories (and other places). I install quelpa using use-package first, and then install quelpa-use-package to allow using quelpa from within use-package declarations. Very recursive.
#+begin_src emacs-lisp
  ;; Bootstrapping quelpa
  ;; (unless (package-installed-p 'quelpa)
  ;;   (with-temp-buffer
  ;;     (url-insert-file-contents "https://raw.githubusercontent.com/quelpa/quelpa/master/quelpa.el")
  ;;     (eval-buffer)
  ;;     (quelpa-self-upgrade)))
  (use-package quelpa
    :defer nil
    :custom
    (quelpa-checkout-melpa-p nil)
    :config
    (quelpa
     '(quelpa-use-package
       :fetcher git
       :url "https://github.com/quelpa/quelpa-use-package.git"))
    (require 'quelpa-use-package))
  (require 'quelpa)
  (quelpa-use-package-activate-advice)
#+end_src
* Basic UI Configuration

#+begin_src emacs-lisp
    ;; Define variables section
    (defvar efs/default-font-size 160)
    (defvar efs/default-variable-font-size 160)

    ;; Make frame transparency overridable
    (defvar efs/frame-transparency '(90 . 90))


    (setq inhibit-startup-message t)

    (if (display-graphic-p)
        (progn
          (set-fringe-mode 10)        ; Give some breathing room
          (tooltip-mode -1)           ; Disable tooltips
          (tool-bar-mode -1)
          (scroll-bar-mode -1)))

    (set-face-attribute 'default nil :font "Fira Code Retina" :height efs/default-font-size)
    ;; Set the fixed pitch face
    (set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height efs/default-font-size)
    ;; Set the variable pitch face
    (set-face-attribute 'variable-pitch nil :font "Cantarell" :height efs/default-variable-font-size :weight 'regular)

    (menu-bar-mode -1)            ; Disable the menu bar
    ;; Set up the visible bell
    (setq visible-bell nil)
    ;; Change cursor color
    ;;(set-cursor-color "#000000")

    (dolist (mode '(org-mode-hook
                    term-mode-hook
                    shell-mode-hook
                    vterm-mode-hook
                    eww-mode-hook
                    treemacs-mode-hook
                    nov-mode-hook
                    pdf-view-mode-hook
                    lsp-ui-imenu-hook
                    eshell-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0))))

    (column-number-mode)

    ;; Prevent asking for confirmation to kill processes when exiting.
    (custom-set-variables '(confirm-kill-processes nil))

    ;; set default encoding
    (set-language-environment "UTF-8")
    (prefer-coding-system       'utf-8)
    (set-default-coding-systems 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8)
    (setq default-buffer-file-coding-system 'utf-8)

  ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

    ;; line numbers
    (when (>= emacs-major-version 26)
    (use-package display-line-numbers
      :defer nil
      :ensure nil
      :config
      (global-display-line-numbers-mode)))

    ;; Highlight trailing whitespace in red, so it’s easily visible
    ;;(disabled for now as it created a lot of noise in some modes, e.g. the org-mode export screen)
     (custom-set-variables '(show-trailing-whitespace nil))

    ;; Highlight matching parenthesis
    (show-paren-mode)
#+end_src
* Basic Editor behaviour
#+begin_src emacs-lisp
  ;; Make Asynchronous operations loaded to use later
  (use-package async)

  ;; Start the emacs server
  ;; (server-start)

  (add-hook 'before-save-hook 'time-stamp)

  ;; When at the beginning of the line, make Ctrl-K remove the whole line, instead of just emptying it.
  (custom-set-variables '(kill-whole-line t))

  ;; Paste text where the cursor is, not where the mouse is.
  (custom-set-variables '(mouse-yank-at-point t))

  ;; Make completion case-insensitive.
  (setq completion-ignore-case t)
  (custom-set-variables
   '(read-buffer-completion-ignore-case t)
   '(read-file-name-completion-ignore-case t))

  ;; Don’t use hard tabs
  (custom-set-variables '(indent-tabs-mode nil))

  ;; Emacs automatically creates backup files, by default in the same folder as the original file, which often leaves backup files behind. This tells Emacs to put all backups in ~/.emacs.d/backups.
  ;; creates problem with magit commit C-c C-c
  ;; (custom-set-variables
  ;;   '(backup-directory-alist
  ;;    `(("." . ,(concat user-emacs-directory "backups")))))

  ;; WinnerMode makes it possible to cycle and undo window configuration changes
  (when (fboundp 'winner-mode) (winner-mode))

  ;; Delete trailing whitespace before saving a file.
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src
* Keep Folders Clean

We use the [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]] package to keep folders where we edit files and the Emacs configuration folder clean!  It knows about a wide variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and setting these variables yourself.

#+begin_src emacs-lisp

  ;; NOTE: If you want to move everything out of the ~/.emacs.d folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
  ;(setq user-emacs-directory "~/.cache/emacs")

  (use-package no-littering)
  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

* File Management
** Dired

Dired is a built-in file manager for Emacs that does some pretty amazing things!  Here are some key bindings you should try out:

*** Key Bindings
