emacs/.emacs.d/config.org
** Better modeline
#+begin_src emacs-lisp
  (use-package all-the-icons)
  (use-package all-the-icons-ivy
    :after (all-the-icons ivy))

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
#+end_src
** Which key
#+begin_src emacs-lisp
  (use-package which-key
    :defer nil
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))
#+end_src
** Ivy and Counsel
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-M-j" . ivy-immediate-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-M-j" . ivy-immediate-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (("C-x b" . 'persp-counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))
#+end_src

*** Improved Candidate Sorting with prescient.el

prescient.el provides some helpful behavior for sorting Ivy completion candidates based on how recently or frequently you select them.  This can be especially helpful when using =M-x= to run commands that you don't have bound to a key but still need to access occasionally.

This Prescient configuration is optimized for use in System Crafters videos and streams, check out the [[https://youtu.be/T9kygXveEz0][video on prescient.el]] for more details on how to configure it!

#+begin_src emacs-lisp

  (use-package ivy-prescient
    :after counsel
    ;; :custom
    ;; (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))
#+end_src

** Avy
Powerful jumper here is the blog: https://karthinks.com/software/avy-can-do-anything/
#+begin_src emacs-lisp
  (use-package avy
  :ensure t)

  (rune/leader-keys
      "SPC" 'avy-goto-char-2
      "ac" 'avy-goto-char-word
      "aw" 'avy-goto-char-word
      "as" 'avy-goto-char-timer
      "al" 'avy-goto-line
      "ah" 'avy-org-goto-heading-timer
      )
#+end_src
** Ace-Window
Window jumping in emacs
#+begin_src emacs-lisp
  (use-package ace-window
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :config
    (setq aw-background nil))

  ;; Customize the ace-window leading char display
  (set-face-attribute 'aw-leading-char-face nil :height 300 :foreground "chartreuse")

  (rune/leader-keys
    "o" 'ace-window)
#+end_src
** Frog jumper for buffer switching
#+begin_src emacs-lisp
  (use-package frog-jump-buffer
    :ensure t
    :custom
    (frog-jump-buffer-use-all-the-icons-ivy t))

  (rune/leader-keys
    "b" 'frog-jump-buffer)
#+end_src
** Helpful help commands
#+begin_src emacs-lisp
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src
** Text Scaling
#+begin_src emacs-lisp
  (use-package hydra
  :defer t)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (rune/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src
** Visual Fill Mode
#+begin_src emacs-lisp
  (use-package visual-fill)
#+end_src
** Adaptive Wrap
#+begin_src emacs-lisp
      (use-package adaptive-wrap)
#+end_src
** Eww
#+begin_src emacs-lisp
  (add-hook 'eww-mode-hook 'visual-line-mode)
  (add-hook 'eww-mode-hook 'adaptive-wrap-prefix-mode)
#+end_src
** SVG lib
#+begin_src emacs-lisp
  (use-package svg-lib)
#+end_src
** Nano Theme
#+begin_src emacs-lisp
  (use-package nano-theme)
#+end_src
** Unfill
Add “unfill” commands to parallel the “fill” ones, bind A-q to unfill-paragraph and rebind M-q to the unfill-toggle command, which fills/unfills paragraphs alternatively.
#+begin_src emacs-lisp
  ;; (use-package unfill
  ;;   :bind
  ;;   ("M-q" . unfill-toggle)
  ;;   ("A-q" . unfill-paragraph))
#+end_src
** Imenu Anywhere
Provide mode-specific “bookmarks” - press M-i and you will be presented with a list of elements to which you can navigate - they can be headers in org-mode, function names in emacs-lisp, etc.
#+begin_src emacs-lisp
  (use-package imenu-anywhere
    :bind
    ("M-i" . ivy-imenu-anywhere))
#+end_src
** Smooth scrolling
Smooth scrolling (line by line) instead of jumping by half-screens.
#+begin_src emacs-lisp
  (use-package smooth-scrolling
    :config
    (smooth-scrolling-mode 1))
#+end_src

** Perspective EL
Workspaces inside emacs, group simiar file buffers together under a namespace. Each namespace has its own window layout and list of buffers
#+begin_src emacs-lisp
  (use-package perspective
  :ensure t
  :bind (("C-x k" . persp-kill-buffer*))
  :init
  (persp-mode))
#+end_src
* OS specifics
#+begin_src emacs-lisp
  (cond ((eq system-type 'darwin)
         ;; <<Mac settings>>
       (custom-set-variables
         '(mac-command-modifier 'meta)
         '(mac-option-modifier 'alt)
         '(mac-right-option-modifier 'super))
         )
        ((eq system-type 'windows-nt)
         ;; <<Windows settings>>
         )
        ((eq system-type 'gnu/linux)
         ;; <<Linux settings>>
         ))
#+end_src
* Org-mode
** Better font faces
#+begin_src emacs-lisp
  (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.4)
                    (org-level-2 . 1.2)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.2)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
#+end_src

** General
#+begin_src emacs-lisp
  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    ;; :defer t
    ;;:pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . efs/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-agenda-start-with-log-mode t)
    (setq org-src-tab-acts-natively t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-agenda-files
          '("~/dev/personal/org/track.org"))
    (define-key org-mode-map (kbd "C-c C-r") verb-command-map)

    (setq org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
      (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

    (efs/org-font-setup))
#+end_src
** Nicer Bullets
#+begin_src emacs-lisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "✸" "✿")))
    ;; (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")
#+end_src

** Center Org buffers
#+begin_src emacs-lisp
  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))
#+end_src
