emacs/.emacs.d/config.org
** Configure babel languages
#+begin_src emacs-lisp
  (use-package ob-http
    :defer t
    :after (org-mode)
    )

  (with-eval-after-load 'org
   (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (C . t)
       (scheme . t)
       (shell . t)
       (http . t)
       (ein . t)
       (js . t)
       (python . t)))

   (push '("conf-unix" . conf-unix) org-src-lang-modes)
   (setq org-confirm-babel-evaluate nil))
#+end_src
*** Custom Babel execute
**** Json
#+begin_src emacs-lisp
  (defun org-babel-execute:json (body params)
    (let ((jq (cdr (assoc :jq params)))
          (node (cdr (assoc :node params))))
      (cond
       (jq
        (with-temp-buffer
          ;; Insert the JSON into the temp buffer
          (insert body)
          ;; Run jq command on the whole buffer, and replace the buffer
          ;; contents with the result returned from jq
          (shell-command-on-region (point-min) (point-max) (format "jq -r \"%s\"" jq) nil 't)
          ;; Return the contents of the temp buffer as the result
          (buffer-string)))
       (node
        (with-temp-buffer
          (insert (format "const it = %s;" body))
          (insert node)
          (shell-command-on-region (point-min) (point-max) "node -p" nil 't)
          (buffer-string))))))
#+end_src

**** 8085
#+begin_src emacs-lisp
  (defcustom path-to-8085 "~/dev/pyassm"
    "Path to folder where 8085-interpreter was cloned")

  (defcustom org-babel-8085-command (concat
                                     (concat path-to-8085 "/.venv/bin/python ")
                                     (concat path-to-8085 "/main.py"))
    "Name of the command for executing 8085 interpreter.")

  (defun org-babel-execute:8085 (body params)
    (let ((args (cdr (assoc :args params))))
      (org-babel-eval
       (concat
        org-babel-8085-command
        (if args  (concat " -i " args) " -i " ))
       body)))

  ;; place holder major mode wip
  ;; (require 'rx)
  ;; (defvar 8085-mode-map
  ;;   (let ((map (make-sparse-keymap)))
  ;;     map))

  ;; (defconst 8085--font-lock-defaults
  ;;   (let (
  ;;         (instructions '("MVI" "MOV" "ADD" "SUB" "ADI"
  ;;                         "SUI" "JNZ" "JNC" "JZ" "JC" "LXI"
  ;;                         "LXAD" "INR" "DCR" "INX" "DCX" "OUT"
  ;;                         "HLT" "CPI" "CMP" "STA" "LDA"))
  ;;         (registers '(" A " " B " " C " " D " " E " " M ")))
  ;;     `(((,(rx-to-string `(: (or ,@instructions))) 0 font-lock-keyword-face)
  ;;        ("\\([[:word:]]+\\):" 1 font-lock-function-name-face)
  ;;        ;(,(rx-to-string `(: (or ,@registers))) 0 font-lock-type-face)
  ;;        ))))

  ;; ;; (defvar 8085-mode-syntax-table
  ;;   (let ((st (make-syntax-table)))
  ;;     ;; - and _ are word constituents
  ;;     (modify-syntax-entry ?_ "w" st)
  ;;     (modify-syntax-entry ?- "w" st)

  ;;     ;; add comments. lua-mode does something similar, so it shouldn't
  ;;     ;; bee *too* wrong.
  ;;     (modify-syntax-entry ?\; "<" st)
  ;;     (modify-syntax-entry ?\n ">" st)
  ;;     st))

  (define-derived-mode 8085-mode asm-mode "8085"
    "Major mode for 8085.")
#+end_src

** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =<el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("draw" . "src artist"))
    (add-to-list 'org-structure-template-alist '("art" . "src artist"))
    (add-to-list 'org-structure-template-alist '("ex" . "example"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("clang" . "src C :results output :exports both"))
    (add-to-list 'org-structure-template-alist '("cpp" . "src C++ :results output :exports both"))
    (add-to-list 'org-structure-template-alist '("c++" . "src C++ :include <iostream> :main no :results output :exports both :flags -std=c++17 -Wall --pedantic -Werror"))
    (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
    (add-to-list 'org-structure-template-alist '("sasm" . "src 8085 :export both :args -db /tmp/8085-session1"))
    (add-to-list 'org-structure-template-alist '("asm" . "src 8085"))
    (add-to-list 'org-structure-template-alist '("py" . "src python :exports both :results output"))
    (add-to-list 'org-structure-template-alist '("ein" . "src ein-python :session localhost :results output"))
    (add-to-list 'org-structure-template-alist '("ht" . "src http")))
    ;;(setq org-structure-template-alist '())
#+end_src

** Auto tangle configuration file
#+begin_src emacs-lisp
    ;; Automatically tangle our Emacs.org config file when we save it
    (defun efs/org-babel-tangle-config ()
      (when (string-equal (buffer-file-name)
                          (expand-file-name "~/dev/dotfiles/emacs/.emacs.d/config.org"))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))

  (defun efs/org-babel-tangle-neovim-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/dev/dotfiles/neovim/init.org"))


      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

    (add-hook 'org-mode-hook
        (lambda ()
          (add-hook 'after-save-hook #'efs/org-babel-tangle-config)
          (add-hook 'after-save-hook #'efs/org-babel-tangle-neovim-config)))
#+end_src

** Custom org utilities
*** Auto export on save (toggler)
#+begin_src emacs-lisp
  (defun toggle-org-markdown-export-on-save ()
    (interactive)
    (if (memq 'org-md-export-to-markdown after-save-hook)
        (progn
          (remove-hook 'after-save-hook 'org-md-export-to-markdown t)
          (message "Disabled org markdown export on save for current buffer..."))
      (add-hook 'after-save-hook 'org-md-export-to-markdown nil t)
      (message "Enabled org markdown export on save for current buffer...")))
#+end_src

** Org-download
Repo: https://github.com/abo-abo/org-download

#+begin_src emacs-lisp
    (use-package org-download
    ;; Drag-and-drop to 'dired'
     :hook (dired-mode-hook . org-download-enable)
           (org-mode-hook . org-download-enable))
    ;; (add-hook 'dired-mode-hook 'org-download-enable)
#+end_src

** Clocking Work times
Org allows clocking time spend on task
To save the clock history across Emacs sessions, use:
#+begin_src emacs-lisp
  ;; (setq org-clock-persist 'history)
  ;; (org-clock-persistence-insinuate)
#+end_src
** Auto export feature
#+begin_src emacs-lisp
(defun org-export-all (backend)
  "Export all subtrees that are *not* tagged with :noexport: to
separate files.

Subtrees that do not have the :EXPORT_FILE_NAME: property set
are exported to a filename derived from the headline text."
  (interactive "sEnter backend: ")
  (let ((fn (cond ((equal backend "html") 'org-html-export-to-html)
                  ((equal backend "latex") 'org-latex-export-to-latex)
                  ((equal backend "pdf") 'org-latex-export-to-pdf)))
        (modifiedp (buffer-modified-p)))
    (save-excursion
      (set-mark (point-min))
      (goto-char (point-max))
      (org-map-entries
       (lambda ()
         (let ((export-file (org-entry-get (point) "EXPORT_FILE_NAME")))
           (unless export-file
             (org-set-property
              "EXPORT_FILE_NAME"
              (replace-regexp-in-string " " "_" (nth 4 (org-heading-components)))))
           (funcall fn nil t)
           (unless export-file (org-delete-property "EXPORT_FILE_NAME"))
           (set-buffer-modified-p modifiedp)))
       "-noexport" 'region-start-level))))
#+end_src
** Auto TOC features github compatible
#+begin_src emacs-lisp
  (use-package org-make-toc
  :defer t
  :commands (org-make-toc)
  )
#+end_src
* Org-roam
