emacs/.emacs.d/config.org
*** Automatically copy (or move) completed tasks to dailies
One interesting use for daily files is to keep a log of tasks that were completed on that particular day. What if we could automatically copy completed tasks in any Org Mode file to today's daily file?

We can do this by adding some custom code!

The following snippet sets up a hook for all Org task state changes and then copies the completed (DONE) entry to today's note file:


#+begin_src emacs-lisp
(defun my/org-roam-copy-todo-to-today ()
  (interactive)
  (let ((org-refile-keep t) ;; Set this to nil to delete the original!
        (org-roam-dailies-capture-templates
          '(("t" "tasks" entry "%?"
             :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d: %A>\n" ("Tasks")))))
        (org-after-refile-insert-hook #'save-buffer)
        today-file
        pos)
    (save-window-excursion
      (org-roam-dailies--capture (current-time) t)
      (setq today-file (buffer-file-name))
      (setq pos (point)))

    ;; Only refile if the target file is different than the current file
    (unless (equal (file-truename today-file)
                   (file-truename (buffer-file-name)))
      (org-refile nil nil (list "Tasks" today-file nil pos)))))

(add-to-list 'org-after-todo-state-change-hook
             (lambda ()
               (when (equal org-state "DONE")
                 (my/org-roam-copy-todo-to-today))))
#+end_src

If you want to move the completed task instead, set org-refile-keep in this code to nil!
This code is a little more advanced, so consult the next section to learn more about how it works!

**** How it works

To be notified on changes to TODO item states, we add the my/org-roam-copy-todo-to-today function to the org-after-todo-state-change-hook list.

When the user completes a task, this function will set up a "daily" temporary capture template which will jump to a heading called "Tasks" in the file for today's date. This is wrapped in a save-window-excursion call to ensure that the capture job won't change your window configuration and current buffer.

If the file being captured to is not the file for the current date, we call org-refile to copy (or move if org-refile-keep is nil) the item to the new location! This avoids moving a completed task back into the file it already lives in (this will raise an error!)
** Encrypted GPG roam files
   [[info:org-roam#Encryption][Org Roam manual about org-roam#Encryption]]
#+begin_src emacs-lisp
  ;; DOt execute taskes over default capture Argghhh!
  ;; (setq org-roam-capture-templates '(("d" "default" plain "%?"
       ;; :target (file+head "${slug}.org.gpg"
                          ;; "#+title: ${title}\n")
       ;; :unnarrowed t)))
#+end_src

* Readings/Ebooks
** Pdf-Tools
#+begin_src emacs-lisp
  (use-package pdf-tools
  :defer t
  :commands (pdf-view-mode pdf-tools-install)
  :mode ("\\.[pP][dD][fF]\\'" . pdf-view-mode)
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install)
  (define-pdf-cache-function pagelabels)
  :hook ((pdf-view-mode-hook . (lambda () (display-line-numbers-mode nil)))
         (pdf-view-mode-hook . pdf-tools-enable-minor-mode)
         (pdf-view-mode-hook . pdf-annot-list-follow-minor-mode)
  ))
#+end_src

*** Org Pdftools + org Noter  + org Noter Pdftools
#+begin_src emacs-lisp
    (use-package org-noter
    :after pdftools
    :config
    ;; Your org-noter config ........
    (require 'org-noter-pdftools))

  (use-package org-pdftools
    :hook (org-mode . org-pdftools-setup-link))

  (use-package org-noter-pdftools
    :after org-noter
    :config
    ;; Add a function to ensure precise note is inserted
    (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
      (interactive "P")
      (org-noter--with-valid-session
       (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                     (not org-noter-insert-note-no-questions)
                                                   org-noter-insert-note-no-questions))
             (org-pdftools-use-isearch-link t)
             (org-pdftools-use-freestyle-annot t))
         (org-noter-insert-note (org-noter--get-precise-info)))))

    ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
    (defun org-noter-set-start-location (&optional arg)
      "When opening a session with this document, go to the current location.
  With a prefix ARG, remove start location."
      (interactive "P")
      (org-noter--with-valid-session
       (let ((inhibit-read-only t)
             (ast (org-noter--parse-root))
             (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
         (with-current-buffer (org-noter--session-notes-buffer session)
           (org-with-wide-buffer
            (goto-char (org-element-property :begin ast))
            (if arg
                (org-entry-delete nil org-noter-property-note-location)
              (org-entry-put nil org-noter-property-note-location
                             (org-noter--pretty-print-location location))))))))
    (with-eval-after-load 'pdf-annot
      (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))
#+end_src

*** Continuous scroll for Pdftools
#+begin_src emacs-lisp
  (use-package pdf-continuous-scroll-mode
    :quelpa (pdf-continuous-scroll-mode :fetcher git
                                :repo "dalanicolai/pdf-continuous-scroll-mode.el")
    :hook (pdf-view-mode-hook . pdf-continuous-scroll-mode))
#+end_src
** Elfeed
#+begin_src emacs-lisp
  ;; Configure Elfeed
   (use-package elfeed
     :ensure t
     :config
     (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
           elfeed-show-entry-switch 'display-buffer)
     :bind
     ("C-x w" . elfeed ))
#+end_src
*** Elfeed-Org
#+begin_src emacs-lisp
  ;; Configure Elfeed with org mode
  (use-package elfeed-org
    :defer t
    :after (org-mode)
    :ensure t
    :config
   (setq elfeed-show-entry-switch 'display-buffer)
   (setq rmh-elfeed-org-files (list "~/dev/personal/org/track.org")))
#+end_src
** Nov for EPUBS
#+begin_src emacs-lisp
  (use-package nov
    :defer t
    :commands nov-mode
    :config
    (evil-set-initial-state 'nov-mode 'emacs)
    (setq nov-text-width t)
    (setq visual-fill-column-center-text t)
    (add-hook 'nov-mode-hook 'visual-line-mode)
    (add-hook 'nov-mode-hook 'visual-fill-column-mode)
    :mode ("\\.epub\\'" . nov-mode))
#+end_src

** Wiki summary
Provides a summary on any topic from wikipedia. Previously it opened in separate buffer had to switch and kill using c-x 0 the commented fix makes it a q closable auto focus nice buffer. Its now merged but great code example for extension in emacs.
#+begin_src emacs-lisp
  (use-package wiki-summary
    :defer 1
    :bind ("C-c W" . wiki-summary))
  ;;   :preface
  ;;   (defun my/format-summary-in-buffer (summary)
  ;;     "Given a summary, stick it in the *wiki-summary* buffer and display the buffer"
  ;;     (let ((buf (generate-new-buffer "*wiki-summary*")))
  ;;       (with-current-buffer buf
  ;;         (princ summary buf)
  ;;         (fill-paragraph)
  ;;         (goto-char (point-min))
  ;;         (text-mode)
  ;;         (view-mode))
  ;;       (pop-to-buffer buf))))
  ;; (advice-add 'wiki-summary/format-summary-in-buffer :override #'my/format-summary-in-buffer)
#+end_src

* Development
** Languages
*** IDE features with LSP Mode
**** Lsp-mode
#+begin_src emacs-lisp
  (defun efs/lsp-mode-setup ()
      (setq lspheaderline-breadcumb-segments '(path-up-to-project file symbols))
      (lsp-headerline-breadcrumb-mode))

      (use-package lsp-mode
      :commands (lsp lsp-deferred)
      :hook (lsp-mode . efs/lsp-mode-setup)
      :init
      (setq lsp-keymap-prefix "C-c l")
      (setq lsp-lens-enable t)
      (setq lsp-signature-auto-activate nil)
      ;; (setq lsp-enable-file-watchers nil)
      :config
      (lsp-enable-which-key-integration t))
#+end_src
**** Dap-mode
#+begin_src emacs-lisp
     (use-package dap-mode
    :after lsp-mode)

    (rune/leader-keys
      "d"  'dap-hydra :which-key "dap hydra")
#+end_src

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
#+end_src

**** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)
    (with-eval-after-load 'treemacs
    (treemacs-resize-icons 15))
#+end_src

