emacs/.emacs.d/init.el
  (let ((org-refile-keep t) ;; Set this to nil to delete the original!
        (org-roam-dailies-capture-templates
          '(("t" "tasks" entry "%?"
             :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d: %A>\n" ("Tasks")))))
        (org-after-refile-insert-hook #'save-buffer)
        today-file
        pos)
    (save-window-excursion
      (org-roam-dailies--capture (current-time) t)
      (setq today-file (buffer-file-name))
      (setq pos (point)))

    ;; Only refile if the target file is different than the current file
    (unless (equal (file-truename today-file)
                   (file-truename (buffer-file-name)))
      (org-refile nil nil (list "Tasks" today-file nil pos)))))

(add-to-list 'org-after-todo-state-change-hook
             (lambda ()
               (when (equal org-state "DONE")
                 (my/org-roam-copy-todo-to-today))))

;; DOt execute taskes over default capture Argghhh!
;; (setq org-roam-capture-templates '(("d" "default" plain "%?"
     ;; :target (file+head "${slug}.org.gpg"
                        ;; "#+title: ${title}\n")
     ;; :unnarrowed t)))

(use-package pdf-tools
:defer t
:commands (pdf-view-mode pdf-tools-install)
:mode ("\\.[pP][dD][fF]\\'" . pdf-view-mode)
:magic ("%PDF" . pdf-view-mode)
:config
(pdf-tools-install)
(define-pdf-cache-function pagelabels)
:hook ((pdf-view-mode-hook . (lambda () (display-line-numbers-mode nil)))
       (pdf-view-mode-hook . pdf-tools-enable-minor-mode)
       (pdf-view-mode-hook . pdf-annot-list-follow-minor-mode)
))

(use-package org-noter
  :after pdftools
  :config
  ;; Your org-noter config ........
  (require 'org-noter-pdftools))

(use-package org-pdftools
  :hook (org-mode . org-pdftools-setup-link))

(use-package org-noter-pdftools
  :after org-noter
  :config
  ;; Add a function to ensure precise note is inserted
  (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
    (interactive "P")
    (org-noter--with-valid-session
     (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                   (not org-noter-insert-note-no-questions)
                                                 org-noter-insert-note-no-questions))
           (org-pdftools-use-isearch-link t)
           (org-pdftools-use-freestyle-annot t))
       (org-noter-insert-note (org-noter--get-precise-info)))))

  ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
  (defun org-noter-set-start-location (&optional arg)
    "When opening a session with this document, go to the current location.
With a prefix ARG, remove start location."
    (interactive "P")
    (org-noter--with-valid-session
     (let ((inhibit-read-only t)
           (ast (org-noter--parse-root))
           (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
       (with-current-buffer (org-noter--session-notes-buffer session)
         (org-with-wide-buffer
          (goto-char (org-element-property :begin ast))
          (if arg
              (org-entry-delete nil org-noter-property-note-location)
            (org-entry-put nil org-noter-property-note-location
                           (org-noter--pretty-print-location location))))))))
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))

(use-package pdf-continuous-scroll-mode
  :quelpa (pdf-continuous-scroll-mode :fetcher git
                              :repo "dalanicolai/pdf-continuous-scroll-mode.el")
  :hook (pdf-view-mode-hook . pdf-continuous-scroll-mode))

;; Configure Elfeed
 (use-package elfeed
   :ensure t
   :config
   (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
         elfeed-show-entry-switch 'display-buffer)
   :bind
   ("C-x w" . elfeed ))

;; Configure Elfeed with org mode
(use-package elfeed-org
  :defer t
  :after (org-mode)
  :ensure t
  :config
 (setq elfeed-show-entry-switch 'display-buffer)
 (setq rmh-elfeed-org-files (list "~/dev/personal/org/track.org")))

(use-package nov
  :defer t
  :commands nov-mode
  :config
  (evil-set-initial-state 'nov-mode 'emacs)
  (setq nov-text-width t)
  (setq visual-fill-column-center-text t)
  (add-hook 'nov-mode-hook 'visual-line-mode)
  (add-hook 'nov-mode-hook 'visual-fill-column-mode)
  :mode ("\\.epub\\'" . nov-mode))

(use-package wiki-summary
  :defer 1
  :bind ("C-c W" . wiki-summary))
;;   :preface
;;   (defun my/format-summary-in-buffer (summary)
;;     "Given a summary, stick it in the *wiki-summary* buffer and display the buffer"
;;     (let ((buf (generate-new-buffer "*wiki-summary*")))
;;       (with-current-buffer buf
;;         (princ summary buf)
;;         (fill-paragraph)
;;         (goto-char (point-min))
;;         (text-mode)
;;         (view-mode))
;;       (pop-to-buffer buf))))
;; (advice-add 'wiki-summary/format-summary-in-buffer :override #'my/format-summary-in-buffer)

(defun efs/lsp-mode-setup ()
    (setq lspheaderline-breadcumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

    (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    (setq lsp-lens-enable t)
    (setq lsp-signature-auto-activate nil)
    ;; (setq lsp-enable-file-watchers nil)
    :config
    (lsp-enable-which-key-integration t))

(use-package dap-mode
:after lsp-mode)

(rune/leader-keys
  "d"  'dap-hydra :which-key "dap hydra")

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)
  (with-eval-after-load 'treemacs
  (treemacs-resize-icons 15))
