emacs/.emacs.d/config.org
**** lsp-ivy

[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp

  (use-package lsp-ivy
  :after lsp)
#+end_src

**** FlyCheck
#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :defer t
    :config
     (setq flycheck-python-pyright-executable "~/.emacs.d/var/lsp/server/npm/pyright")
    :init (global-flycheck-mode))
#+end_src
**** Smart Parens
#+begin_src emacs-lisp
  (use-package smartparens)
  (require 'smartparens-config)
#+end_src
*** Python
**** Python Mode
#+begin_src emacs-lisp
    (use-package python-mode
    :ensure t
    :hook (python-mode . lsp-deferred)
    :custom
    (python-shell-interpreter "python3")
    (dap-python-executable "python3")
    (dap-python-debugger 'ptvsd)
    :config
    (require 'dap-python)
    )
#+end_src
**** Poetry
#+begin_src emacs-lisp
  (use-package poetry
  :after python-mode)
  ;; :config
  ;; (message "Poetry loaded")
  ;; (poetry-tracking-mode))
#+end_src
**** Lsp-pyright
#+begin_src emacs-lisp
  (use-package lsp-pyright
    :defer t
    :ensure t
    :hook (python-mode . (lambda ()
                            (require 'lsp-pyright)
                            (lsp)  ; lsp or lsp-deferred
                            (poetry-tracking-mode)))

    (ein:ipynb-mode . poetry-tracking-mode))
#+end_src
**** Black Formatting
#+begin_src emacs-lisp
  (use-package blacken
    :demand t
    :after poetry
    :hook (poetry-tracking-mode . blacken-mode))
    ;;:customize
    ;;(blacken-only-if-project-is-blackened))
#+end_src
**** Manim build after save
#+begin_src emacs-lisp
  (defun manim-build-img ()
      "Build manim image after saving a file"
      (when (or (string-equal (buffer-file-name)
                          (expand-file-name "~/dev/manim/manim/mathgaps/test.py"))
             (string-equal (file-name-directory buffer-file-name)
                          (expand-file-name "~/dev/manim/manim/mathgaps/scripts/")))
        (async-shell-command (format "cd ~/dev/manim/manim/mathgaps && poetry run python -m manim -ql -r 1920,1080 %s" buffer-file-name))))

  (defun kivy-build ()
    "Build kivy app after saving a file"
      (when (string-equal (file-name-directory buffer-file-name)
                          (expand-file-name "~/dev/kivy/test/"))
      (shell-command-to-string "cp main.py /mnt/d/projects/kivy/test/ && cd /mnt/d/projects/kivy/test && poetry.exe run python main.py")))

  (defun sphinx-build ()
      "Build sphinx html builds after saving a file"
      (when (string-equal (file-name-directory buffer-file-name)
                          (expand-file-name "~/dev/c-practice/cipher-site/"))
        (async-shell-command (format "rm -rf _build/html && poetry run make html" buffer-file-name))))

    (add-hook 'after-save-hook #'manim-build-img)
    (add-hook 'after-save-hook #'sphinx-build)
#+end_src
*** Flutter/Dart
**** Dart-Mode
#+begin_src emacs-lisp
  (use-package dart-mode
    :defer t
    :custom
    (dart-sdk-path (concat (getenv "HOME") "/local/flutter/bin/cache/dark-sdk/")
    dart-format-on-save t))
#+end_src
**** Lsp-dart
#+begin_src emacs-lisp
  (use-package lsp-dart
      :defer t
      :ensure t
      :hook (dart-mode . (lambda ()
                            (require 'lsp-dart)
                            (lsp))))  ; lsp or lsp-deferred
#+end_src
**** Hover
#+begin_src emacs-lisp
    (use-package hover
      :after dart-mode
  ;;    :bind (:map dart-mode-map
  ;;                ("C-M-z" . #'hover-run-or-hot-reload)
   ;;               ("C-M-x" . #'hover-run-or-hot-restart)
    ;;              ("C-M-p" . #'hover-take-screenshot'))
      :init
      (setq hover-flutter-sdk-path (concat (getenv "HOME") "/local/flutter")
            hover-command-path (concat (getenv "GOPATH") "/bin/hover")
            hover-hot-reload-on-save t
            hover-screenshot-path (concat "/mnt/d/" "images/flutter")
            hover-screenshot-prefix "emacs-"
            hover-observatory-uri "http://0.0.0.0:50300"
            hover-clear-buffer-on-hot-restart t))
#+end_src
*** C/C++
#+begin_src emacs-lisp
  (with-eval-after-load 'lsp-mode
   (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
   (require 'dap-cpptools)
   (yas-global-mode))
  (add-hook 'c-mode-hook 'lsp)
  (add-hook 'c++-mode-hook 'lsp)
#+end_src
**** Optional debugging with emacs-gdb
#+begin_src emacs-lisp
  (use-package gdb-mi :quelpa (gdb-mi :fetcher git
                                      :url "https://github.com/weirdNox/emacs-gdb.git"
                                      :files ("*.el" "*.c" "*.h" "Makefile"))
    :init
    (fmakunbound 'gdb)
    (fmakunbound 'gdb-enable-debug))
#+end_src

*** Typescript
(use-package typescript-mode
    :mode "\\.ts\\'" ;; only load/open for .ts file
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
*** Lua
#+begin_src emacs-lisp
  (use-package lua-mode
      :mode "\\.lua\\'" ;; only load/open for .ts file
      :hook (lua-mode . lsp-deferred)
      :config
      (setq lua-indent-level 3)
      (setq lua-documentation-function 'browse-web))
#+end_src

*** Racket
#+begin_src emacs-lisp
  (use-package racket-mode
  :hook (racket-xp-mode . racket-mode))
#+end_src
*** EIN
IPYTHON babyyy!
#+begin_src emacs-lisp
  (use-package ein
  :defer t
  :custom
  (ein:output-area-inlined-images nil))
#+end_src
*** Jupyter notebook
#+begin_src emacs-lisp
;;(use-package jupyter)
#+end_src
*** Latex
**** Math Preview
#+begin_src emacs-lisp
  (use-package math-preview
  :defer t
  :custom
  (math-preview-command "/home/pykancha/.config/nvm/versions/node/v14.17.6/bin/math-preview"))
#+end_src
** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind ;;(:map company-active-map
           ;;("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.5))

  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src

*** Company Tabnine
#+begin_src emacs-lisp
  (use-package company-tabnine
    :ensure t
    :config
    ;; Trigger completion immediately.
    (setq company-idle-delay 0)
    ;; Number the candidates (use M-1, M-2 etc to select completions).
    (setq company-show-numbers t)
    )
  (add-to-list 'company-backends #'company-tabnine)
#+end_src

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/dev")
      (setq projectile-project-search-path '("~/dev")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+end_src
** Magit
#+begin_src emacs-lisp
  (use-package magit
    :defer t
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  ;; (use-package forge
  ;; :after magit)

  ;; (use-package magit-delta
  ;; :after magit
  ;; :config
  ;; (add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1))))
#+end_src
** Commenting

Emacs' built in commenting functionality =comment-dwim= (usually bound to =M-;=) doesn't always comment things in the way you might expect so we use [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] to provide a more familiar behavior.  I've bound it to =M-/= since other editors sometimes use this binding but you could also replace Emacs' =M-;= binding with this command.

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

** Rainbow-delimeters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Yasnippet
Yasnippet is the snippet tool for emacs. It doesnot bundle the snippets itself though which should be separately installed.
#+begin_src emacs-lisp
  (use-package yasnippet
  :defer t
  :config
  (setq yas-snippet-dirs '("~/dev/dotfiles/emacs/snippets/"))
  (yas-global-mode 1))

  (use-package yasnippet-snippets
    :after yasnippet)
#+end_src
** WebPaste
Paste a selected region or buffer and get the link
#+begin_src emacs-lisp
  (use-package webpaste
    ;; :bind (("C-c C-p C-b" . webpaste-paste-buffer)
           ;; ("C-c C-p C-r" . webpaste-paste-region))
    :custom (webpaste-provider-priority '("ix.io" "dpaste.com")))
#+end_src
