emacs/.emacs.d/init.el

(use-package lsp-ivy
:after lsp)

(use-package flycheck
  :ensure t
  :defer t
  :config
   (setq flycheck-python-pyright-executable "~/.emacs.d/var/lsp/server/npm/pyright")
  :init (global-flycheck-mode))

(use-package smartparens)
(require 'smartparens-config)

(use-package python-mode
:ensure t
:hook (python-mode . lsp-deferred)
:custom
(python-shell-interpreter "python3")
(dap-python-executable "python3")
(dap-python-debugger 'ptvsd)
:config
(require 'dap-python)
)

(use-package poetry
:after python-mode)
;; :config
;; (message "Poetry loaded")
;; (poetry-tracking-mode))

(use-package lsp-pyright
  :defer t
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp)  ; lsp or lsp-deferred
                          (poetry-tracking-mode)))

  (ein:ipynb-mode . poetry-tracking-mode))

(use-package blacken
  :demand t
  :after poetry
  :hook (poetry-tracking-mode . blacken-mode))
  ;;:customize
  ;;(blacken-only-if-project-is-blackened))

(defun manim-build-img ()
    "Build manim image after saving a file"
    (when (or (string-equal (buffer-file-name)
                        (expand-file-name "~/dev/manim/manim/mathgaps/test.py"))
           (string-equal (file-name-directory buffer-file-name)
                        (expand-file-name "~/dev/manim/manim/mathgaps/scripts/")))
      (async-shell-command (format "cd ~/dev/manim/manim/mathgaps && poetry run python -m manim -ql -r 1920,1080 %s" buffer-file-name))))

(defun kivy-build ()
  "Build kivy app after saving a file"
    (when (string-equal (file-name-directory buffer-file-name)
                        (expand-file-name "~/dev/kivy/test/"))
    (shell-command-to-string "cp main.py /mnt/d/projects/kivy/test/ && cd /mnt/d/projects/kivy/test && poetry.exe run python main.py")))

(defun sphinx-build ()
    "Build sphinx html builds after saving a file"
    (when (string-equal (file-name-directory buffer-file-name)
                        (expand-file-name "~/dev/c-practice/cipher-site/"))
      (async-shell-command (format "rm -rf _build/html && poetry run make html" buffer-file-name))))

  (add-hook 'after-save-hook #'manim-build-img)
  (add-hook 'after-save-hook #'sphinx-build)

(use-package dart-mode
  :defer t
  :custom
  (dart-sdk-path (concat (getenv "HOME") "/local/flutter/bin/cache/dark-sdk/")
  dart-format-on-save t))

(use-package lsp-dart
    :defer t
    :ensure t
    :hook (dart-mode . (lambda ()
                          (require 'lsp-dart)
                          (lsp))))  ; lsp or lsp-deferred

(use-package hover
    :after dart-mode
;;    :bind (:map dart-mode-map
;;                ("C-M-z" . #'hover-run-or-hot-reload)
 ;;               ("C-M-x" . #'hover-run-or-hot-restart)
  ;;              ("C-M-p" . #'hover-take-screenshot'))
    :init
    (setq hover-flutter-sdk-path (concat (getenv "HOME") "/local/flutter")
          hover-command-path (concat (getenv "GOPATH") "/bin/hover")
          hover-hot-reload-on-save t
          hover-screenshot-path (concat "/mnt/d/" "images/flutter")
          hover-screenshot-prefix "emacs-"
          hover-observatory-uri "http://0.0.0.0:50300"
          hover-clear-buffer-on-hot-restart t))

(with-eval-after-load 'lsp-mode
 (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
 (require 'dap-cpptools)
 (yas-global-mode))
(add-hook 'c-mode-hook 'lsp)
(add-hook 'c++-mode-hook 'lsp)

(use-package gdb-mi :quelpa (gdb-mi :fetcher git
                                    :url "https://github.com/weirdNox/emacs-gdb.git"
                                    :files ("*.el" "*.c" "*.h" "Makefile"))
  :init
  (fmakunbound 'gdb)
  (fmakunbound 'gdb-enable-debug))

(use-package lua-mode
    :mode "\\.lua\\'" ;; only load/open for .ts file
    :hook (lua-mode . lsp-deferred)
    :config
    (setq lua-indent-level 3)
    (setq lua-documentation-function 'browse-web))

(use-package racket-mode
:hook (racket-xp-mode . racket-mode))

(use-package ein
:defer t
:custom
(ein:output-area-inlined-images nil))

;;(use-package jupyter)

(use-package math-preview
:defer t
:custom
(math-preview-command "/home/pykancha/.config/nvm/versions/node/v14.17.6/bin/math-preview"))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind ;;(:map company-active-map
         ;;("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.5))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package company-tabnine
  :ensure t
  :config
  ;; Trigger completion immediately.
  (setq company-idle-delay 0)
  ;; Number the candidates (use M-1, M-2 etc to select completions).
  (setq company-show-numbers t)
  )
(add-to-list 'company-backends #'company-tabnine)

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/dev")
    (setq projectile-project-search-path '("~/dev")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package magit
  :defer t
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; (use-package forge
;; :after magit)

;; (use-package magit-delta
;; :after magit
;; :config
;; (add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1))))

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package yasnippet
:defer t
:config
(setq yas-snippet-dirs '("~/dev/dotfiles/emacs/snippets/"))
(yas-global-mode 1))

(use-package yasnippet-snippets
  :after yasnippet)

(use-package webpaste
  ;; :bind (("C-c C-p C-b" . webpaste-paste-buffer)
         ;; ("C-c C-p C-r" . webpaste-paste-region))
  :custom (webpaste-provider-priority '("ix.io" "dpaste.com")))
