emacs/.emacs.d/config.org
** Undo-Tree
#+begin_src emacs-lisp
  (use-package undo-tree
  :ensure t
  :config
  (global-undo-tree-mode))
#+end_src
** Verb Mode
Best REST API explorer using org-mode
#+begin_src emacs-lisp
  (use-package verb
  :ensure t)

#+end_src
** Harpoon beby
Inspired by the legend primeagen some vim inspired goodness in my emacs config oooo ya babyyy
#+begin_src emacs-lisp
  (use-package harpoon
    :config
      (rune/leader-keys
        "hf" 'harpoon-toggle-file
        "ha" 'harpoon-add-file
        "hh" 'harpoon-toggle-quick-menu
        "hd" 'harpoon-clear
        "h1" 'harpoon-go-to-1
        "h2" 'harpoon-go-to-2
        "h3" 'harpoon-go-to-3
        "h4" 'harpoon-go-to-4
        "h5" 'harpoon-go-to-5
        "h6" 'harpoon-go-to-6
        "h7" 'harpoon-go-to-7
        "h8" 'harpoon-go-to-8
        "h9" 'harpoon-go-to-9
        ))
#+end_src
* Terminals
** Term Mode

One important thing to understand is =line-mode= versus =char-mode=.  =line-mode= enables you to use normal Emacs keybindings while moving around in the terminal buffer while =char-mode= sends most of your keypresses to the underlying terminal.  While using =term-mode=, you will want to be in =char-mode= for any terminal applications that have their own keybindings.  If you're just in your usual shell, =line-mode= is sufficient and feels more integrated with Emacs.

With =evil-collection= installed, you will automatically switch to =char-mode= when you enter Evil's insert mode (press =i=).  You will automatically be switched back to =line-mode= when you enter Evil's normal mode (press =ESC=).

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =C-c C-k= - Enter char-mode
- =C-c C-j= - Return to line-mode
- If you have =evil-collection= installed, =term-mode= will enter char mode when you use Evil's Insert mode

#+begin_src emacs-lisp
  (use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "zsh"))
  ;; Change this to zsh, etc
  ;;(setq explicit-zsh-args '())
  ;; Use 'explicit-<shell>-args for shell-specific args

    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    ;; (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

#+end_src
*** Better term-mode colors

The =eterm-256color= package enhances the output of =term-mode= to enable handling of a wider range of color codes so that many popular terminal applications look as you would expect them to.  Keep in mind that this package requires =ncurses= to be installed on your machine so that it has access to the =tic= program.  Most Linux distributions come with this program installed already so you may not have to do anything extra to use it.

#+begin_src emacs-lisp
;; Bad support in WSL with X11 server
;;  (use-package eterm-256color
;;    :hook (term-mode . eterm-256color-mode))

#+end_src

** Vterm
[[https://github.com/akermu/emacs-libvterm/][vterm]] is an improved terminal emulator package which uses a compiled native module to interact with the underlying terminal applications.  This enables it to be much faster than =term-mode= and to also provide a more complete terminal emulation experience.

Make sure that you have the [[https://github.com/akermu/emacs-libvterm/#requirements][necessary dependencies]] installed before trying to use =vterm= because there is a module that will need to be compiled before you can use it successfully.

Creates conflict with magit, specially when updating and recompiling from melpa
Utrafast modern terminal written in C libvterm.
#+begin_src emacs-lisp
  ;; (use-package vterm
  ;;   :commands vterm
  ;;   :config
  ;;   (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
    ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    ;; (setq vterm-max-scrollback 10000))
#+end_src

** shell-mode

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Interactive-Shell.html#Interactive-Shell][shell-mode]] is a middle ground between =term-mode= and Eshell.  It is *not* a terminal emulator so more complex terminal programs will not run inside of it.  It does have much better integration with Emacs because all command input in this mode is handled by Emacs and then sent to the underlying shell once you press Enter.  This means that you can use =evil-mode='s editing motions on the command line, unlike in the terminal emulator modes above.

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =M-p= / =M-n= - go back and forward in the input history
- =C-c C-u= - delete the current input string backwards up to the cursor
- =counsel-shell-history= - A searchable history of commands typed into the shell

One advantage of =shell-mode= on Windows is that it's the only way to run =cmd.exe=, PowerShell, Git Bash, etc from within Emacs.  Here's an example of how you would set up =shell-mode= to run PowerShell on Windows:

#+begin_src emacs-lisp

  (when (eq system-type 'windows-nt)
    (setq explicit-shell-file-name "powershell.exe")
    (setq explicit-powershell.exe-args '()))

#+end_src

** Eshell

[[https://www.gnu.org/software/emacs/manual/html_mono/eshell.html#Contributors-to-Eshell][Eshell]] is Emacs' own shell implementation written in Emacs Lisp.  It provides you with a cross-platform implementation (even on Windows!) of the common GNU utilities you would find on Linux and macOS (=ls=, =rm=, =mv=, =grep=, etc).  It also allows you to call Emacs Lisp functions directly from the shell and you can even set up aliases (like aliasing =vim= to =find-file=).  Eshell is also an Emacs Lisp REPL which allows you to evaluate full expressions at the shell.

The downsides to Eshell are that it can be harder to configure than other packages due to the particularity of where you need to set some options for them to go into effect, the lack of shell completions (by default) for some useful things like Git commands, and that REPL programs sometimes don't work as well.  However, many of these limitations can be dealt with by good configuration and installing external packages, so don't let that discourage you from trying it!

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =M-p= / =M-n= - go back and forward in the input history
- =C-c C-u= - delete the current input string backwards up to the cursor
- =counsel-esh-history= - A searchable history of commands typed into Eshell

For more thoughts on Eshell, check out these articles by Pierre Neidhardt:
- https://ambrevar.xyz/emacs-eshell/index.html
- https://ambrevar.xyz/emacs-eshell-versus-shell/index.html

#+begin_src emacs-lisp

  (defun efs/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt
    :after eshell)

  (use-package eshell
    :hook (eshell-first-time-mode . efs/configure-eshell)
    :config

    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "zsh" "vim")))
    (eshell-git-prompt-use-theme 'powerline))

#+end_src

* Apps
** Dashboard
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :if (< (length command-line-args) 2)
    :init
    (dashboard-setup-startup-hook)
    :config
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

    ;; Set the title
  (setq dashboard-banner-logo-title "Pykancha eMacs")
  ;; Set the banner
  (setq dashboard-startup-banner 'logo)
  ;; Value can be
  ;; 'official which displays the official emacs logo
  ;; 'logo which displays an alternative emacs logo
  ;; 1, 2 or 3 which displays one of the text banners
  ;; "path/to/your/image.gif", "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever gif/image/text you would prefer

  ;; Content is not centered by default. To center, set
  (setq dashboard-center-content t)

  ;; To disable shortcut "jump" indicators for each section, set
  (setq dashboard-show-shortcuts nil)

  (setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (agenda . 5)
                        ))
  )
#+end_src
** Telega.el
#+begin_src emacs-lisp
  ;; Sent alert in emacs (useful for telegram alerts)
  (use-package alert
    :defer t
    )
  ;; detect language automatically (telegram chats code highlight)
  (use-package language-detection)

  (use-package telega
    :defer t
    :commands (telega)
    :config
  (telega-mode-line-mode 1)
  ;; Attach org links to-fro telega chats
  (require 'ol-telega)

  ;; Highlight telegram code blocks in emacs
  (require 'telega-mnz)
  (global-telega-mnz-mode 1)

  ;; Open telega chat buffer and dired side by side and execute dired-do-copy after selecting files it will be sent
  (require 'telega-dired-dwim)

  ;; Send alerts using alert.el
  (require 'telega-alert)
  (telega-alert-mode 1)

  ;; beautify and shorted urls in chat eg: githubusername/repo
  (require 'telega-url-shorten)
  (global-telega-url-shorten-mode)
  (setq telega-url-shorten-use-images t)

  ;; Block channel ads promotion
  (require 'telega-adblock)
  (telega-adblock-mode 1)

  ;; Magit style transiet key
  (require 'telega-transient)
  (telega-transient-mode 1)

  (require 'telega-stories)
  (telega-stories-mode 1)
  ;; "Emacs Stories" rootview
  ;; (define-key telega-root-mode-map (kbd "v e") 'telega-view-emacs-stories)
  ;; Emacs Dashboard
  (add-to-list 'dashboard-items '(telega-stories . 5))
  )
  (define-key global-map (kbd "C-c t") telega-prefix-map)
#+end_src
** Speed type
#+begin_src emacs-lisp
  (use-package speed-type)
#+end_src
** Ascii Artist drawing to Unicode
Artist mode companion:
#+begin_src emacs-lisp
(use-package ascii-art-to-unicode)
#+end_src
* Emacs Outside
** Edit Server
#+begin_src emacs-lisp
  (use-package edit-server
   :config
    (edit-server-start))
#+end_src
* Runtime Performance

Dial the GC threshold back down so that garbage collection happens more frequently but in less time.

#+begin_src emacs-lisp
  ;; Make gc pauses faster by decreasing the threshold.
  (setq gc-cons-threshold (* 1 1000 1000))
#+end_src
* Macros
