emacs/.emacs.d/init.el

(use-package undo-tree
:ensure t
:config
(global-undo-tree-mode))

(use-package verb
:ensure t)

(use-package harpoon
  :config
    (rune/leader-keys
      "hf" 'harpoon-toggle-file
      "ha" 'harpoon-add-file
      "hh" 'harpoon-toggle-quick-menu
      "hd" 'harpoon-clear
      "h1" 'harpoon-go-to-1
      "h2" 'harpoon-go-to-2
      "h3" 'harpoon-go-to-3
      "h4" 'harpoon-go-to-4
      "h5" 'harpoon-go-to-5
      "h6" 'harpoon-go-to-6
      "h7" 'harpoon-go-to-7
      "h8" 'harpoon-go-to-8
      "h9" 'harpoon-go-to-9
      ))

(use-package term
:commands term
:config
(setq explicit-shell-file-name "zsh"))
;; Change this to zsh, etc
;;(setq explicit-zsh-args '())
;; Use 'explicit-<shell>-args for shell-specific args

  ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
  ;; (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

;; Bad support in WSL with X11 server
;;  (use-package eterm-256color
;;    :hook (term-mode . eterm-256color-mode))

;; (use-package vterm
;;   :commands vterm
;;   :config
;;   (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
  ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
  ;; (setq vterm-max-scrollback 10000))

(when (eq system-type 'windows-nt)
  (setq explicit-shell-file-name "powershell.exe")
  (setq explicit-powershell.exe-args '()))

(defun efs/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :hook (eshell-first-time-mode . efs/configure-eshell)
  :config

  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim")))
  (eshell-git-prompt-use-theme 'powerline))

(use-package dashboard
  :ensure t
  :if (< (length command-line-args) 2)
  :init
  (dashboard-setup-startup-hook)
  :config
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

  ;; Set the title
(setq dashboard-banner-logo-title "Pykancha eMacs")
;; Set the banner
(setq dashboard-startup-banner 'logo)
;; Value can be
;; 'official which displays the official emacs logo
;; 'logo which displays an alternative emacs logo
;; 1, 2 or 3 which displays one of the text banners
;; "path/to/your/image.gif", "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever gif/image/text you would prefer

;; Content is not centered by default. To center, set
(setq dashboard-center-content t)

;; To disable shortcut "jump" indicators for each section, set
(setq dashboard-show-shortcuts nil)

(setq dashboard-items '((recents  . 5)
                      (bookmarks . 5)
                      (agenda . 5)
                      ))
)

;; Sent alert in emacs (useful for telegram alerts)
(use-package alert
  :defer t
  )
;; detect language automatically (telegram chats code highlight)
(use-package language-detection)

(use-package telega
  :defer t
  :commands (telega)
  :config
(telega-mode-line-mode 1)
;; Attach org links to-fro telega chats
(require 'ol-telega)

;; Highlight telegram code blocks in emacs
(require 'telega-mnz)
(global-telega-mnz-mode 1)

;; Open telega chat buffer and dired side by side and execute dired-do-copy after selecting files it will be sent
(require 'telega-dired-dwim)

;; Send alerts using alert.el
(require 'telega-alert)
(telega-alert-mode 1)

;; beautify and shorted urls in chat eg: githubusername/repo
(require 'telega-url-shorten)
(global-telega-url-shorten-mode)
(setq telega-url-shorten-use-images t)

;; Block channel ads promotion
(require 'telega-adblock)
(telega-adblock-mode 1)

;; Magit style transiet key
(require 'telega-transient)
(telega-transient-mode 1)

(require 'telega-stories)
(telega-stories-mode 1)
;; "Emacs Stories" rootview
;; (define-key telega-root-mode-map (kbd "v e") 'telega-view-emacs-stories)
;; Emacs Dashboard
(add-to-list 'dashboard-items '(telega-stories . 5))
)
(define-key global-map (kbd "C-c t") telega-prefix-map)

(use-package speed-type)

(use-package ascii-art-to-unicode)

(use-package edit-server
 :config
  (edit-server-start))

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 1 1000 1000))
