emacs/.emacs.d/config.org
** Decorate sh and example code
When copy pasted from repl interaction. This decorates cmd (one line) as sh and result with example.
#+begin_src emacs-lisp
(fset 'sh\ and\ example\ decorate
   (kmacro-lambda-form [escape ?k ?j ?\" ?2 escape ?@ ?q ?2 ?@ ?q ?@ ?q ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?k ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j ?j] 0 "%d"))
#+end_src
** Aroud symbol insert equals
#+begin_src emacs-lisp
(fset 'around_literal_equal
   (kmacro-lambda-form [?v ?i ?o escape ?b ?i ?= escape ?e ?a ?= escape] 0 "%d"))
#+end_src

* Custom Daemon config
#+begin_src emacs-lisp
  (if (daemonp)
      (with-temp-buffer
        "~/dev/dotfiles/emacs/.emacs.d/init.el"
    (eval-buffer)
    ))

#+end_src
